//1
//ввод через prompt: цена и процент скидки.
//вывод (console.log): итоговая цена и сумма скидки
//проверить, что цена и скидка не отрицательные и скидка не более 100%

//ввод (prompt): сумма заказа
//до 50 - 10р доставка
//50-100 - 5р
//от 100 - бесплатно
//вывод: стоимость доставки и итог цену
//решать через switch case

//3 - циклы
//для целого числа вывести в консоль: количество цифр, сумма цифр, максимальная цифра
//2021: 4 цифры, сумма 5, максимальная 2

//4 - массивы
const items = ['js', 'css', 'js', 'html', 'css', 'react'];
//вернуть массив без повторов

//5
const cart = [
  { name: 'Keyboard', price: 50, qty: 1 },
  { name: 'Mouse', price: 25, qty: 2 },
  { name: 'Monitor', price: 200, qty: 1 },
];
//посчитать итоговую сумму
//найти самый дорогой товар
//посчитать количество позиций
